CSI API ETABS v1
cGridSys.SetGridSys Method
 Adds a new grid system, or modifies an existing grid system.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGridSys(
	string Name,
	double x,
	double y,
	double RZ
)
Function SetGridSys (
	Name As String,
	x As Double,
	y As Double,
	RZ As Double
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim x As Double
Dim y As Double
Dim RZ As Double
Dim returnValue As Integer
returnValue = instance.SetGridSys(Name,
	x, y, RZ)
int SetGridSys(
	String^ Name,
	double x,
	double y,
	double RZ
)
abstract SetGridSys :
        Name : string *
        x : float *
        y : float *
        RZ : float -> int
Parameters
Name
Type: System.String
 This is the name of a grid system. If this is the name of an existing grid system, that grid system is modified, otherwise a new grid system is added.
x
Type: System.Double
 The global X grid of the origin of the grid system. [L]
y
Type: System.Double
 The global Y grid of the origin of the grid system. [L]
RZ
Type: System.Double
 The rotation of an axis of the new grid system relative to the global grid system is defined as follows: (1) Rotate the grid system about the positive global Z-axis as defined by the RZ item. [deg]
Return Value
Type: Int32
 Returns zero if the grid system is successfully added or modified, otherwise it returns a nonzero value.
Remarks
 Modifying the Global grid system will fail and return an error.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new grid system
   ret = SapModel.GridSys.SetGridSys("GridSysA", 1000, 1000, 0)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cGridSys Interface
ETABSv1 Namespace